#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimToTexture

#include "Basic.hpp"

#include "AnimToTexture_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AnimToTexture.AnimToTextureDataAsset.GetIndexFromAnimSequence
// 0x0010 (0x0010 - 0x0000)
struct AnimToTextureDataAsset_GetIndexFromAnimSequence final
{
public:
	const class UAnimSequence*                    Sequence;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimToTextureDataAsset_GetIndexFromAnimSequence;

// Function AnimToTexture.AnimToTextureInstancePlaybackLibrary.AllocateInstanceData
// 0x0028 (0x0028 - 0x0000)
struct AnimToTextureInstancePlaybackLibrary_AllocateInstanceData final
{
public:
	struct FAnimToTextureInstanceData             InstanceData;                                      // 0x0000(0x0020)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimToTextureInstancePlaybackLibrary_AllocateInstanceData;

// Function AnimToTexture.AnimToTextureInstancePlaybackLibrary.AnimStateFromDataAsset
// 0x0028 (0x0028 - 0x0000)
struct AnimToTextureInstancePlaybackLibrary_AnimStateFromDataAsset final
{
public:
	const class UAnimToTextureDataAsset*          DataAsset;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StateIndex;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimToTextureAnimState                AnimState;                                         // 0x000C(0x0014)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimToTextureInstancePlaybackLibrary_AnimStateFromDataAsset;

// Function AnimToTexture.AnimToTextureInstancePlaybackLibrary.BatchUpdateInstancedMeshComponent
// 0x0028 (0x0028 - 0x0000)
struct AnimToTextureInstancePlaybackLibrary_BatchUpdateInstancedMeshComponent final
{
public:
	class UInstancedStaticMeshComponent*          InstancedMeshComponent;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimToTextureInstanceData             InstanceData;                                      // 0x0008(0x0020)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AnimToTextureInstancePlaybackLibrary_BatchUpdateInstancedMeshComponent;

// Function AnimToTexture.AnimToTextureInstancePlaybackLibrary.GetInstancePlaybackData
// 0x0040 (0x0040 - 0x0000)
struct AnimToTextureInstancePlaybackLibrary_GetInstancePlaybackData final
{
public:
	struct FAnimToTextureInstanceData             InstanceData;                                      // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         InstanceIndex;                                     // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimToTextureInstancePlaybackData     InstancePlaybackData;                              // 0x0024(0x0014)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimToTextureInstancePlaybackLibrary_GetInstancePlaybackData;

// Function AnimToTexture.AnimToTextureInstancePlaybackLibrary.GetInstanceTransform
// 0x00A0 (0x00A0 - 0x0000)
struct AnimToTextureInstancePlaybackLibrary_GetInstanceTransform final
{
public:
	struct FAnimToTextureInstanceData             InstanceData;                                      // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         InstanceIndex;                                     // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             InstanceTransform;                                 // 0x0030(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0xF];                                       // 0x0091(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimToTextureInstancePlaybackLibrary_GetInstanceTransform;

// Function AnimToTexture.AnimToTextureInstancePlaybackLibrary.SetupInstancedMeshComponent
// 0x0030 (0x0030 - 0x0000)
struct AnimToTextureInstancePlaybackLibrary_SetupInstancedMeshComponent final
{
public:
	class UInstancedStaticMeshComponent*          InstancedMeshComponent;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimToTextureInstanceData             InstanceData;                                      // 0x0008(0x0020)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         NumInstances;                                      // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimToTextureInstancePlaybackLibrary_SetupInstancedMeshComponent;

// Function AnimToTexture.AnimToTextureInstancePlaybackLibrary.UpdateInstanceData
// 0x00B0 (0x00B0 - 0x0000)
struct AnimToTextureInstancePlaybackLibrary_UpdateInstanceData final
{
public:
	struct FAnimToTextureInstanceData             InstanceData;                                      // 0x0000(0x0020)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         InstanceIndex;                                     // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimToTextureInstancePlaybackData     PlaybackData;                                      // 0x0024(0x0014)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0040(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00A0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0xF];                                       // 0x00A1(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AnimToTextureInstancePlaybackLibrary_UpdateInstanceData;

// Function AnimToTexture.VATMeshComponent.SetAnimation
// 0x0008 (0x0008 - 0x0000)
struct VATMeshComponent_SetAnimation final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InTimeStartOffset;                                 // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VATMeshComponent_SetAnimation;

// Function AnimToTexture.VATMeshComponent.GetAnimation
// 0x0010 (0x0010 - 0x0000)
struct VATMeshComponent_GetAnimation final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimToTextureMiniAnimState            ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VATMeshComponent_GetAnimation;

// Function AnimToTexture.VATMeshComponent.GetNumAnimations
// 0x0004 (0x0004 - 0x0000)
struct VATMeshComponent_GetNumAnimations final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VATMeshComponent_GetNumAnimations;

}

