#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_RaceSequenceStateSendRaceEnd

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "UnionRun_structs.hpp"
#include "Engine_structs.hpp"
#include "UnionSystem_structs.hpp"
#include "UnionLib_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPC_RaceSequenceStateSendRaceEnd.BPC_RaceSequenceStateSendRaceEnd_C.ConvertStickerData
// 0x0178 (0x0178 - 0x0000)
struct BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData final
{
public:
	struct FUserStickerData                       UserStickerData;                                   // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FCommon_MachineStickerData             Common_MachineStickerData;                         // 0x0028(0x0068)(Parm, OutParm)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_2;        // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_3;        // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_4;        // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FCommon_MachineStickerData             K2Node_MakeStruct_Common_MachineStickerData;       // 0x00E8(0x0068)()
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1; // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_2; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_3; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_4; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_RaceSequenceStateSendRaceEnd_C_ConvertStickerData;

// Function BPC_RaceSequenceStateSendRaceEnd.BPC_RaceSequenceStateSendRaceEnd_C.EndPlatformGameMatch
// 0x00D0 (0x00D0 - 0x0000)
struct BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch final
{
public:
	TArray<struct FCommon_UserOrderData>          LocalUserOrder;                                    // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCommon_UserOrderData                  CallFunc_Array_Get_Item;                           // 0x0020(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULobbyContextBase*                      CallFunc_GetPublicLobbyContext_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonLobbyContext*                    K2Node_DynamicCast_AsCommon_Lobby_Context;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULobbyMemberContextBase*>        CallFunc_GetAllMembers_OutResult;                  // 0x0068(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULobbyMemberContextBase*                CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetUserIdString_OutResult;                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FCommon_UserOrderData                  K2Node_MakeStruct_Common_UserOrderData;            // 0x00A0(0x0018)()
	class FString                                 CallFunc_GetInternalUserId_ReturnValue;            // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_RaceSequenceStateSendRaceEnd_C_EndPlatformGameMatch;

// Function BPC_RaceSequenceStateSendRaceEnd.BPC_RaceSequenceStateSendRaceEnd_C.ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd
// 0x13A8 (0x13A8 - 0x0000)
struct BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ApiName, const class FString& RequestData, const class FString& ResponseData, bool Error)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FResultSaveFestaResultRequest          CallFunc_GetResultSaveFestaResultRequest_Request;  // 0x0018(0x0418)()
	bool                                          CallFunc_GetResultSaveFestaResultRequest_IsSuccess; // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FResultSaveRankMatchResultRequest      CallFunc_GetResultSaveRankMatchResultRequest_Request; // 0x0438(0x03F8)()
	bool                                          CallFunc_GetResultSaveRankMatchResultRequest_IsSuccess; // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue;        // 0x0831(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_832[0x6];                                      // 0x0832(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0838(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0848(0x0010)()
	class FString                                 K2Node_CustomEvent_DispStr;                        // 0x0858(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bError;                         // 0x0868(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_869[0x7];                                      // 0x0869(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0870(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_BoolToText_ReturnValue;              // 0x08B8(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x08C8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x08D8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0920(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0968(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0978(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0988(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ApiName_1;                      // 0x0998(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_RequestData_1;                  // 0x09A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ResponseData_1;                 // 0x09B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Error_1;                        // 0x09C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C9[0x3];                                      // 0x09C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Parse_ResultSaveFestaResult_ResCode;      // 0x09CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FResultSaveFestaResultResponse         CallFunc_Parse_ResultSaveFestaResult_Response;     // 0x09D0(0x0160)()
	class FString                                 K2Node_CustomEvent_ApiName_2;                      // 0x0B30(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_RequestData_2;                  // 0x0B40(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ResponseData_2;                 // 0x0B50(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Error_2;                        // 0x0B60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetResultFestaData_bSuccess;              // 0x0B61(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B62[0x2];                                      // 0x0B62(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Parse_ResultSaveRankMatchResult_ResCode;  // 0x0B64(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FResultSaveRankMatchResultResponse     CallFunc_Parse_ResultSaveRankMatchResult_Response; // 0x0B68(0x00F8)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0C60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameModeId                                   CallFunc_GetSelectedGameModeId_ReturnValue_1;      // 0x0C64(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0C65(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckSkipCurrentState_ReturnValue;        // 0x0C66(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C67[0x1];                                      // 0x0C67(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlineMatchSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0C68(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOnlineMatchSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0C70(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableOnlineSinglePlay_ReturnValue;     // 0x0C78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableOnlineSinglePlay_ReturnValue_1;   // 0x0C79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C7A[0x6];                                      // 0x0C7A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlineMatchSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0C80(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableOnlineSinglePlay_ReturnValue_2;   // 0x0C88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C89[0x3];                                      // 0x0C89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0C8C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0C90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C91[0x3];                                      // 0x0C91(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0C94(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0C98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0C99(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9A[0x2];                                      // 0x0C9A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0C9C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNetMasterDataManageSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0CA0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<ELegendCompeRateGrade, struct FRewardDataArr> CallFunc_GetCurrentLegendCompeGradeRewardMap_OutRateGrade_RewardDataArrStructMap; // 0x0CA8(0x0050)()
	struct FRewardDataArr                         CallFunc_Map_Find_Value;                           // 0x0CF8(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0D08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D09[0x7];                                      // 0x0D09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FResultSaveLegendCompeResultRequest    CallFunc_GetResultSaveLegendCompeResultRequest_Request; // 0x0D10(0x0400)()
	bool                                          CallFunc_GetResultSaveLegendCompeResultRequest_IsSuccess; // 0x1110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1111[0x3];                                     // 0x1111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRewardBaseData                        CallFunc_Array_Get_Item;                           // 0x1114(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x1120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetReward_ReturnValue;                    // 0x1124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1125[0x3];                                     // 0x1125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostCalcLegendCompeRatingParam        K2Node_MakeStruct_PostCalcLegendCompeRatingParam;  // 0x1128(0x0004)(NoDestructor)
	bool                                          CallFunc_GetHonorTitleUnlock_ReturnValue;          // 0x112C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x112D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112E[0x2];                                     // 0x112E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveDataManageSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x1130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ApiName;                        // 0x1138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_RequestData;                    // 0x1148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ResponseData;                   // 0x1158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Error;                          // 0x1168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1169[0x3];                                     // 0x1169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Parse_ResultSaveLegendCompeResult_ResCode; // 0x116C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FResultSaveLegendCompeResultResponse   CallFunc_Parse_ResultSaveLegendCompeResult_Response; // 0x1170(0x00F8)()
	class USaveDataManageSubsystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x1268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESaveDataStatus Status)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x1270(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNetMasterDataManageSubsystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x1280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLegendCompeId_ReturnValue;             // 0x1288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddLegendCompeEnteredSeason_ReturnValue;  // 0x128C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EResponseCodeAbstract                         CallFunc_ValidateResCode_ResCodeAbstract;          // 0x128D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateResCode_ReturnValue;              // 0x128E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_128F[0x1];                                     // 0x128F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& ApiName, const class FString& RequestData, const class FString& ResponseData, bool Error)> K2Node_CreateDelegate_OutputDelegate_2; // 0x1290(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppSequenceLogManagerSubsystem*        CallFunc_GetGameInstanceSubsystem_ReturnValue_7;   // 0x12A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESequenceSubType                              CallFunc_GetSequenceSubType_ReturnValue;           // 0x12A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceMainType                             CallFunc_GetSequenceMainType_ReturnValue;          // 0x12A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12AA[0x6];                                     // 0x12AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppSequenceLogManagerSubsystem*        CallFunc_GetGameInstanceSubsystem_ReturnValue_8;   // 0x12B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppSequenceLogManagerSubsystem*        CallFunc_GetGameInstanceSubsystem_ReturnValue_9;   // 0x12B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESaveDataStatus                               K2Node_CustomEvent_Status;                         // 0x12C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C1[0x7];                                     // 0x12C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_10;  // 0x12C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_11;  // 0x12D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULobbyContextBase*                      CallFunc_GetPublicLobbyContext_ReturnValue;        // 0x12D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULobbyContextBase*                      CallFunc_GetPublicLobbyContext_ReturnValue_1;      // 0x12E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonLobbyContext*                    K2Node_DynamicCast_AsCommon_Lobby_Context;         // 0x12E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x12F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x12F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12F2[0x6];                                     // 0x12F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEntryRaceId_ReturnValue;               // 0x12F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCommonLobbyContext*                    K2Node_DynamicCast_AsCommon_Lobby_Context_1;       // 0x1308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x1310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1311[0x7];                                     // 0x1311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULobbyMemberContextBase*                CallFunc_GetHostMember_ReturnValue;                // 0x1318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRaceHostLocalUser_ReturnValue;          // 0x1320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1321[0x7];                                     // 0x1321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       CallFunc_GetLocalUserId_OutUserId;                 // 0x1328(0x0030)(HasGetValueTypeHash)
	class ULobbyMemberContextBase*                CallFunc_GetMember_ReturnValue;                    // 0x1358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x1360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x1364(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x1365(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1366[0x2];                                     // 0x1366(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x1368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EResponseCodeAbstract                         CallFunc_ValidateResCode_ResCodeAbstract_1;        // 0x136C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateResCode_ReturnValue_1;            // 0x136D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELegendCompeRateGrade                         CallFunc_GetCurrentLegendCompeGrade_ReturnValue;   // 0x136E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EResponseCodeAbstract                         CallFunc_ValidateResCode_ResCodeAbstract_2;        // 0x136F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValidateResCode_ReturnValue_2;            // 0x1370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1371[0x3];                                     // 0x1371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x1374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_12;  // 0x1378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULobbyContextBase*                      CallFunc_GetPublicLobbyContext_ReturnValue_2;      // 0x1380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x1388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x1389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue_1;           // 0x138A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x138B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFairPointAddFairPointRequest          K2Node_MakeStruct_FairPointAddFairPointRequest;    // 0x138C(0x0004)(NoDestructor)
	int32                                         CallFunc_Send_FairPointAddFairPoint_ReturnValue;   // 0x1390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& ApiName, const class FString& RequestData, const class FString& ResponseData, bool Error)> K2Node_CreateDelegate_OutputDelegate_3; // 0x1394(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_RaceSequenceStateSendRaceEnd_C_ExecuteUbergraph_BPC_RaceSequenceStateSendRaceEnd;

// Function BPC_RaceSequenceStateSendRaceEnd.BPC_RaceSequenceStateSendRaceEnd_C.GetHistoryData
// 0x00E0 (0x00E0 - 0x0000)
struct BPC_RaceSequenceStateSendRaceEnd_C_GetHistoryData final
{
public:
	class UCommonLobbyMemberContext*              MemberContext;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCommon_HistoryData                    Common_HistoryData;                                // 0x0008(0x0020)(Parm, OutParm)
	ECarStatusType                                SelectedMachineType;                               // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MyPlayerRacerIndex;                                // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCommon_HistoryData_MachineTypeUsage> LocalUsageMachine;                           // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<struct FCommon_HistoryData_CharacterUsage> LocalUsageChara;                               // 0x0040(0x0010)(Edit, BlueprintVisible)
	class UUnionStatsManager*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     CallFunc_GetSelectedDriverId_OutId;                // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOutputExecsPin_SuccessFailed                 CallFunc_GetSelectedDriverId_OutExecsPin;          // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F[0x1];                                       // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCommon_HistoryData_CharacterUsage> CallFunc_GetTopThreeCharactersUsageAddOne_ReturnValue; // 0x0068(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECarStatusType                                CallFunc_GetSelectedMachineType_OutMachineType;    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOutputExecsPin_SuccessFailed                 CallFunc_GetSelectedMachineType_OutExecsPin;       // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerRacerIndex_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CallFunc_GetUsageCountByMachineType_OutDataArray;  // 0x0088(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCommon_HistoryData_MachineTypeUsage   K2Node_MakeStruct_Common_HistoryData_MachineTypeUsage; // 0x00AC(0x0008)(NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCommon_HistoryData                    K2Node_MakeStruct_Common_HistoryData;              // 0x00C0(0x0020)()
};
DUMPER7_ASSERTS_BPC_RaceSequenceStateSendRaceEnd_C_GetHistoryData;

// Function BPC_RaceSequenceStateSendRaceEnd.BPC_RaceSequenceStateSendRaceEnd_C.GetPredictCarPacketRequest
// 0x0238 (0x0238 - 0x0000)
struct BPC_RaceSequenceStateSendRaceEnd_C_GetPredictCarPacketRequest final
{
public:
	struct FResultSavePredictCarPacketRequest     Request;                                           // 0x0000(0x0020)(Parm, OutParm)
	bool                                          IsSuccess;                                         // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 TestByte;                                          // 0x0028(0x0010)(Edit, BlueprintVisible)
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<uint8>                                 K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm)
	class ULobbyContextBase*                      CallFunc_GetPublicLobbyContext_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetLocalUserId_OutUserId;                 // 0x0058(0x0030)(HasGetValueTypeHash)
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ConvertUserIdToString_OutUserIdString;    // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<uint8>                                 CallFunc_GetOnlineRaceReplayData_Data;             // 0x00F0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0140(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0198(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01B8(0x0010)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FResultSavePredictCarPacketRequest     K2Node_MakeStruct_ResultSavePredictCarPacketRequest; // 0x0218(0x0020)()
};
DUMPER7_ASSERTS_BPC_RaceSequenceStateSendRaceEnd_C_GetPredictCarPacketRequest;

// Function BPC_RaceSequenceStateSendRaceEnd.BPC_RaceSequenceStateSendRaceEnd_C.GetReplaySignedUrlRequest
// 0x0002 (0x0002 - 0x0000)
struct BPC_RaceSequenceStateSendRaceEnd_C_GetReplaySignedUrlRequest final
{
public:
	struct FCntReplayGetSignedUrlRequest          Request;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsSuccess;                                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_RaceSequenceStateSendRaceEnd_C_GetReplaySignedUrlRequest;

// Function BPC_RaceSequenceStateSendRaceEnd.BPC_RaceSequenceStateSendRaceEnd_C.GetResultSaveFestaResultRequest
// 0x1618 (0x1618 - 0x0000)
struct BPC_RaceSequenceStateSendRaceEnd_C_GetResultSaveFestaResultRequest final
{
public:
	struct FResultSaveFestaResultRequest          Request;                                           // 0x0000(0x0418)(Parm, OutParm)
	bool                                          IsSuccess;                                         // 0x0418(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCommon_UserCheatParamData>     TmpCheatDataArray;                                 // 0x0420(0x0010)(Edit, BlueprintVisible)
	struct FGroupBattleResult                     LocalGroupBattleResult;                            // 0x0430(0x0018)(Edit, BlueprintVisible)
	bool                                          bLocalRacerBonusNoOne;                             // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLocalRacerLeadNoOne;                              // 0x0449(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44A[0x6];                                      // 0x044A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAppRaceTeamResultData>         NewLocalVar;                                       // 0x0450(0x0010)(Edit, BlueprintVisible)
	TArray<struct FCommon_HistoryData_MachineTypeUsage> LocalUsageMachine;                           // 0x0460(0x0010)(Edit, BlueprintVisible)
	TArray<struct FCommon_HistoryData_CharacterUsage> LocalUsageChara;                               // 0x0470(0x0010)(Edit, BlueprintVisible)
	struct FCommon_HistoryData                    LocalHistoryData;                                  // 0x0480(0x0020)(Edit, BlueprintVisible)
	struct FCommon_MachineData                    LocalMachineData;                                  // 0x04A0(0x0370)(Edit, BlueprintVisible)
	struct FCommon_DegreeData                     LocalDegreeData;                                   // 0x0810(0x0008)(Edit, BlueprintVisible, NoDestructor)
	int32                                         LocalCharaId;                                      // 0x0818(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81C[0x4];                                      // 0x081C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FCommon_TeamOrderData>          LocalTeamOrder;                                    // 0x0820(0x0010)(Edit, BlueprintVisible)
	int32                                         LocalFestaId;                                      // 0x0830(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0834(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0838(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x083C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOnlineMatchSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0840(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnableOnlineSinglePlay_ReturnValue;     // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0849(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84A[0x2];                                      // 0x084A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x084C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0850(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFestaIdUtil_ReturnValue;               // 0x0854(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDriverId                                     CallFunc_GetRaceRequestData_OutDriverId;           // 0x0858(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStageId                                      CallFunc_GetRaceRequestData_OutMainStageId;        // 0x0859(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85A[0x6];                                      // 0x085A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCommon_MachineData                    CallFunc_GetRaceRequestData_OutMachineCustomizeData; // 0x0860(0x0370)()
	struct FCommon_GadgetData                     CallFunc_GetRaceRequestData_OutGadgetPlateData;    // 0x0BD0(0x001C)(NoDestructor)
	struct FCommon_DegreeData                     CallFunc_GetRaceRequestData_OutDegreeData;         // 0x0BEC(0x0008)(NoDestructor)
	int32                                         CallFunc_GetFestaMyTeamFriendCount_ReturnValue;    // 0x0BF4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0BF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BFC[0x4];                                      // 0x0BFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0C00(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0C10(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRacerFinalGroupBattleResult_bSuccess;  // 0x0C20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C21[0x7];                                      // 0x0C21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGroupBattleResult                     CallFunc_GetRacerFinalGroupBattleResult_OutGroupBattleResult; // 0x0C28(0x0018)()
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0C40(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULobbyContextBase*                      CallFunc_GetPublicLobbyContext_ReturnValue;        // 0x0C48(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetLocalUserId_OutUserId;                 // 0x0C50(0x0030)(HasGetValueTypeHash)
	class UCommonLobbyContext*                    K2Node_DynamicCast_AsCommon_Lobby_Context;         // 0x0C80(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0C88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C89[0x3];                                      // 0x0C89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMemberRacerIndexFromUserId_OutRacerIndex; // 0x0C8C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetMemberRacerIndexFromUserId_ReturnValue; // 0x0C90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C91[0x7];                                      // 0x0C91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetTeamResultRankList_OutTeamRankList;    // 0x0C98(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0CA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBonusNoOneInGroup_ReturnValue;          // 0x0CAC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0CAD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLeadNoOneInGroup_ReturnValue;           // 0x0CAE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CAF[0x1];                                      // 0x0CAF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAppRaceTeamResultData                 CallFunc_Array_Get_Item;                           // 0x0CB0(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0CBC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0CC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC1[0x3];                                      // 0x0CC1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0CC4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCommon_UserCheatParamData             CallFunc_GetUserUcccParamData_ReturnValue;         // 0x0CC8(0x0020)()
	bool                                          CallFunc_isPlayerControlRacer_ReturnValue;         // 0x0CE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE9[0x3];                                      // 0x0CE9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0CEC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0CF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CF1[0x3];                                      // 0x0CF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0CF4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0CF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CFC[0x4];                                      // 0x0CFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FResultSaveFestaResultRequest          K2Node_MakeStruct_ResultSaveFestaResultRequest;    // 0x0D00(0x0418)()
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x1118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x111C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAppRaceTeamResultData                 K2Node_MakeStruct_AppRaceTeamResultData;           // 0x1120(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x112C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x1130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNetDataManageSubsystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x1138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULobbyContextBase*                      CallFunc_GetPublicLobbyContext_ReturnValue_1;      // 0x1140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULobbyContextBase*                      CallFunc_GetPublicLobbyContext_ReturnValue_2;      // 0x1148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUniqueNetIdRepl                       CallFunc_GetLocalUserId_OutUserId_1;               // 0x1150(0x0030)(HasGetValueTypeHash)
	class UFestaLobbyContext*                     K2Node_DynamicCast_AsFesta_Lobby_Context;          // 0x1180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x1188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1189[0x7];                                     // 0x1189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULobbyMemberContextBase*                CallFunc_GetMember_ReturnValue;                    // 0x1190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_GetTeamMemberFromIndex_MemberIds;         // 0x1198(0x0010)(ReferenceParm)
