#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DriverAnimLayerInterface

#include "Basic.hpp"

#include "UNION_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DriverAnimLayerInterface.DriverAnimLayerInterface_C.HoverboardControlRogLayer
// 0x0020 (0x0020 - 0x0000)
struct DriverAnimLayerInterface_C_HoverboardControlRogLayer final
{
public:
	struct FPoseLink                              HoverboardPose;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HoverboardControlRogLayer_0;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_DriverAnimLayerInterface_C_HoverboardControlRogLayer;

// Function DriverAnimLayerInterface.DriverAnimLayerInterface_C.HoverboardItemHoldBlendLeft
// 0x0030 (0x0030 - 0x0000)
struct DriverAnimLayerInterface_C_HoverboardItemHoldBlendLeft final
{
public:
	struct FPoseLink                              BasePose;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LeftHoldPose;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HoverboardItemHoldBlendLeft_0;                     // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_DriverAnimLayerInterface_C_HoverboardItemHoldBlendLeft;

// Function DriverAnimLayerInterface.DriverAnimLayerInterface_C.HoverboardItemHoldBlendRight
// 0x0030 (0x0030 - 0x0000)
struct DriverAnimLayerInterface_C_HoverboardItemHoldBlendRight final
{
public:
	struct FPoseLink                              BasePose;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              RightHoldPose;                                     // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              HoverboardItemHoldBlendRight_0;                    // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_DriverAnimLayerInterface_C_HoverboardItemHoldBlendRight;

// Function DriverAnimLayerInterface.DriverAnimLayerInterface_C.KawaiiPhysicsLayer
// 0x0020 (0x0020 - 0x0000)
struct DriverAnimLayerInterface_C_KawaiiPhysicsLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              KawaiiPhysicsLayer_0;                              // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_DriverAnimLayerInterface_C_KawaiiPhysicsLayer;

// Function DriverAnimLayerInterface.DriverAnimLayerInterface_C.MachineItemHoldBlendLeft
// 0x0030 (0x0030 - 0x0000)
struct DriverAnimLayerInterface_C_MachineItemHoldBlendLeft final
{
public:
	struct FPoseLink                              BasePose;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LeftHoldPose;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              MachineItemHoldBlendLeft_0;                        // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_DriverAnimLayerInterface_C_MachineItemHoldBlendLeft;

// Function DriverAnimLayerInterface.DriverAnimLayerInterface_C.MachineItemHoldBlendRight
// 0x0030 (0x0030 - 0x0000)
struct DriverAnimLayerInterface_C_MachineItemHoldBlendRight final
{
public:
	struct FPoseLink                              BasePose;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LeftHoldPose;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              MachineItemHoldBlendRight_0;                       // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_DriverAnimLayerInterface_C_MachineItemHoldBlendRight;

// Function DriverAnimLayerInterface.DriverAnimLayerInterface_C.MenuFacialOverride
// 0x0048 (0x0048 - 0x0000)
struct DriverAnimLayerInterface_C_MenuFacialOverride final
{
public:
	struct FPoseLink                              MenuFinalPose;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          InPlayingMontage;                                  // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              MenuDefaltFace;                                    // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              MenuOverrideFace;                                  // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              MenuFacialOverride_0;                              // 0x0038(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_DriverAnimLayerInterface_C_MenuFacialOverride;

// Function DriverAnimLayerInterface.DriverAnimLayerInterface_C.ScaleFaceLayer
// 0x0028 (0x0028 - 0x0000)
struct DriverAnimLayerInterface_C_ScaleFaceLayer final
{
public:
	struct FPoseLink                              InFaceOverride;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          bPlayMontage;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBoneScaleFaceType                            InStateMachineFaceType;                            // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBoneScaleFaceType                            InMontageFaceType;                                 // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              ScaleFaceLayer_0;                                  // 0x0018(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_DriverAnimLayerInterface_C_ScaleFaceLayer;

}

