#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSubsystemRedpointEOS

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "OnlineSubsystemUtils_classes.hpp"


namespace SDK
{

// Class OnlineSubsystemRedpointEOS.EOSControlChannel
// 0x0220 (0x02A0 - 0x0080)
class UEOSControlChannel final : public UControlChannel
{
public:
	uint8                                         Pad_80[0x220];                                     // 0x0080(0x0220)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EOSControlChannel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EOSControlChannel")
	}
	static class UEOSControlChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEOSControlChannel>();
	}
};
DUMPER7_ASSERTS_UEOSControlChannel;

// Class OnlineSubsystemRedpointEOS.EOSIpNetConnection
// 0x0000 (0x1E90 - 0x1E90)
class UEOSIpNetConnection final : public UIpConnection
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EOSIpNetConnection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EOSIpNetConnection")
	}
	static class UEOSIpNetConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEOSIpNetConnection>();
	}
};
DUMPER7_ASSERTS_UEOSIpNetConnection;

// Class OnlineSubsystemRedpointEOS.EOSNetConnection
// 0x0010 (0x1E10 - 0x1E00)
class UEOSNetConnection final : public UNetConnection
{
public:
	uint8                                         Pad_1E00[0x10];                                    // 0x1E00(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EOSNetConnection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EOSNetConnection")
	}
	static class UEOSNetConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEOSNetConnection>();
	}
};
DUMPER7_ASSERTS_UEOSNetConnection;

// Class OnlineSubsystemRedpointEOS.EOSNetDriver
// 0x0078 (0x09F0 - 0x0978)
class UEOSNetDriver final : public UIpNetDriver
{
public:
	uint8                                         Pad_978[0x68];                                     // 0x0978(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEOSNetConnection*>              PendingConnectionClose;                            // 0x09E0(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EOSNetDriver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EOSNetDriver")
	}
	static class UEOSNetDriver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEOSNetDriver>();
	}
};
DUMPER7_ASSERTS_UEOSNetDriver;

// Class OnlineSubsystemRedpointEOS.EOSSubsystem
// 0x0038 (0x0068 - 0x0030)
class UEOSSubsystem final : public UGameInstanceSubsystem
{
public:
	TMulticastInlineDelegate<void(class UUserWidget* Widget)> OnAddWidgetToViewport;                 // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UUserWidget* Widget)> OnRemoveWidgetFromViewport;            // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EOSSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EOSSubsystem")
	}
	static class UEOSSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEOSSubsystem>();
	}
};
DUMPER7_ASSERTS_UEOSSubsystem;

// Class OnlineSubsystemRedpointEOS.RecentPlayersWorldSubsystem
// 0x0060 (0x0090 - 0x0030)
class URecentPlayersWorldSubsystem final : public UWorldSubsystem
{
public:
	uint8                                         Pad_30[0x60];                                      // 0x0030(0x0060)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RecentPlayersWorldSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RecentPlayersWorldSubsystem")
	}
	static class URecentPlayersWorldSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<URecentPlayersWorldSubsystem>();
	}
};
DUMPER7_ASSERTS_URecentPlayersWorldSubsystem;

}

