#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TitleMenu_Sub_2nd

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TitleMenu_Sub_2nd.WBP_TitleMenu_Sub_2nd_C
// 0x0048 (0x0328 - 0x02E0)
class UWBP_TitleMenu_Sub_2nd_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 KeyVisual_2nd;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TitleLOGO;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TitleMenu_Sub_Btn_C*               WBP_TitleMenu_Sub_Btn;                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Soft_Texture;                                      // 0x0300(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_TitleMenu_Sub_2nd(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetLogoVisibility(ESlateVisibility InVisibility);
	void SetTitleLogoTexture(class UTexture2D* Texture);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TitleMenu_Sub_2nd_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TitleMenu_Sub_2nd_C")
	}
	static class UWBP_TitleMenu_Sub_2nd_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TitleMenu_Sub_2nd_C>();
	}
};
DUMPER7_ASSERTS_UWBP_TitleMenu_Sub_2nd_C;

}

