#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CMN_PlayerDetail_Sub_Info_Gadget_List

#include "Basic.hpp"

#include "UnionSystem_structs.hpp"
#include "UNION_structs.hpp"


namespace SDK::Params
{

// Function WBP_CMN_PlayerDetail_Sub_Info_Gadget_List.WBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C.SetGadgetData
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C_SetGadgetData final
{
public:
	EGadgetId                                     InGadgetId;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDisable;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGadgetData                            CallFunc_GetGadgetData_OutGadgetData;              // 0x0008(0x00C0)()
	bool                                          CallFunc_GetGadgetData_ReturnValue;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_CMN_PlayerDetail_Sub_Info_Gadget_List_C_SetGadgetData;

}

